class AirportNameConverter:

    def __init__(self):
        self.__airport_name_match: dict = {
            'ПУЛКОВО-1': 'Пулково',
            'МИНВОДЫ': 'Минеральные Воды',
            'УФА-1': 'Уфа',
            'ЧЕЛЯБИНС': 'Челябинск',
            'КРАСНЯРС-1': 'Красноярск',
            'ALMAKTUM': 'Almaktum',
            'СЫКТЫВКР': 'Сыктывкар',
            'ТЮМЕНЬ': 'Тюмень',
            'КАЗАНЬ': 'Казань',
            'НИЖНОВГР': 'Нижний Новгород',
            'БАРНАУЛ': 'Барнаул',
            'СОЧИ': 'Сочи',
            'ГУМРАК-С2': 'Волгоград',
            'ГРОЗНЫЙ': 'Грозный',
            'КАЛИНГРД': 'Калининград',
            'НВАРТОВС': 'Нижневартовск',
            'НВАРТОВС-1': 'Нижневартовск',
            'ПЕРМЬ': 'Пермь',
            'САМАРАКР': 'Самара',
            'АРХАНГСК': 'Архангельск',
            'НАЛЬЧИК': 'Нальчик',
            'ОРЕНБУРГ': 'Оренбург',
            'СУРГУТ': 'Сургут',
            'ОМСК': 'Омск',
            'ЕКАТЕРИН': 'Екатеринбург',
            'ЧИТА': 'Чита',
            'МАХАЧКАЛ': 'Махачкала',
            'ВНУКОВО-А': 'Внуково',
            'НОВОСИБТ': 'Новосибирск',
            'ТАШКЕНТ-2': 'Ташкент',
            'МУРМАНСК': 'Мурманск',
            'ЕРЕВАНЗ': 'Ереван'
        }

    def find_match(self, airport):
        return self.__airport_name_match.get(airport, airport)
